/*******************************************************************************
*                 
*                 		       ÆÕÖĞ¿Æ¼¼
--------------------------------------------------------------------------------
* Êµ Ñé Ãû		 : 18B20ÎÂ¶ÈÏÔÊ¾ÊÔÑé
* ÊµÑéËµÃ÷       : LCD1602ÏÔÊ¾ÎÂ¶ÈÖµ¡£
* Á¬½Ó·½Ê½       : ¼ûÁ¬½ÓÍ¼
* ×¢    Òâ		 : 
*******************************************************************************/

#include<reg51.h>
#include"lcd.h"
#include"temp.h"
void LcdDisplay(int);
unsigned char TEMP[7] = "+000.00";

//--ÉùÃ÷È«¾Öº¯Êı--//
void UsartConfiguration();
void Delay10ms(unsigned int c);   //Îó²î 0us

/*******************************************************************************
* º¯ÊıÃû         : main
* º¯Êı¹¦ÄÜ		   : Ö÷º¯Êı
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void main()
{
	unsigned char i;
	LcdInit();			 //³õÊ¼»¯LCD1602
	LcdWriteCom(0x88);	//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('C'); 
	UsartConfiguration();
	while(1)
	{
		LcdDisplay(Ds18b20ReadTemp());
//		Delay1ms(1000);//1sÖÓË¢Ò»´Î
		
		for(i=0; i<7; i++)
		{
			SBUF = TEMP[i];   //½«Òª·¢ËÍµÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
			while(!TI);		  //µÈ´ı·¢ËÍÊı¾İÍê³É
			TI=0;			  //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
		}
		Delay10ms(50);		  //ÑÓÊ±Ò»ÏÂÔÙ·¢
	}
}

/*******************************************************************************
* º¯ÊıÃû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* ÊäÈë           : v
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
    
  	unsigned char datas[5] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
	  	LcdWriteCom(0x80);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	    LcdWriteData('-');  		//ÏÔÊ¾¸º
			TEMP[0]='-';
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{			
	  	LcdWriteCom(0x80);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	    LcdWriteData('+'); 		//ÏÔÊ¾Õı
			TEMP[0]='+';
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
	datas[3] = temp % 100 / 10;
	datas[4] = temp % 10;
  TEMP[1]='0'+datas[0];
	TEMP[2]='0'+datas[1];
	TEMP[3]='0'+datas[2];
	TEMP[5]='0'+datas[3];
	TEMP[6]='0'+datas[4];
	LcdWriteCom(0x82);		  //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[0]); //°ÙÎ» 

	
	LcdWriteCom(0x83);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[1]); //Ê®Î»

	LcdWriteCom(0x84);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[2]); //¸öÎ» 

	LcdWriteCom(0x85);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('.'); 		//ÏÔÊ¾ ¡®.¡¯

	LcdWriteCom(0x86);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[3]); //ÏÔÊ¾Ğ¡Êıµã  

	LcdWriteCom(0x87);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[4]); //ÏÔÊ¾Ğ¡Êıµã  
}


/*******************************************************************************
* º¯ Êı Ãû         :UsartConfiguration()
* º¯Êı¹¦ÄÜ		   :ÉèÖÃ´®¿Ú
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void UsartConfiguration()
{
	SCON=0X50;			//ÉèÖÃÎª¹¤×÷·½Ê½1
	TMOD=0X20;			//ÉèÖÃ¼ÆÊıÆ÷¹¤×÷·½Ê½2
	PCON=0X80;			//²¨ÌØÂÊ¼Ó±¶
	TH1=0XF3;		    //¼ÆÊıÆ÷³õÊ¼ÖµÉèÖÃ£¬×¢Òâ²¨ÌØÂÊÊÇ4800µÄ
	TL1=0XF3;
//	ES=1;						//´ò¿ª½ÓÊÕÖĞ¶Ï
//	EA=1;						//´ò¿ª×ÜÖĞ¶Ï
	TR1=1;					    //´ò¿ª¼ÆÊıÆ÷
}

/*******************************************************************************
* º¯ Êı Ãû         : Delay10ms
* º¯Êı¹¦ÄÜ		   : ÑÓÊ±º¯Êı£¬ÑÓÊ±10ms
* Êä    Èë         : ÎŞ
* Êä    ³ö         : ÎŞ
*******************************************************************************/

void Delay10ms(unsigned int c)   //Îó²î 0us
{
    unsigned char a, b;

	//--cÒÑ¾­ÔÚ´«µİ¹ıÀ´µÄÊ±ºòÒÑ¾­¸³ÖµÁË£¬ËùÒÔÔÚforÓï¾äµÚÒ»¾ä¾Í²»ÓÃ¸³ÖµÁË--//
    for (;c>0;c--)
	{
		for (b=38;b>0;b--)
		{
			for (a=130;a>0;a--);
		}          
	}       
}